## Staging: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                           NAME                            |
|----------|-----------------------------------------------------------|
| add      | `aws_security_group_rule.client_vpn_ingress_database`     |
| update   | `aws_rds_cluster_parameter_group.enable_audit_logging_v8` |
| recreate | `aws_secretsmanager_secret_version.database_host`         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_rds_cluster_parameter_group.enable_audit_logging_v8 will be updated in-place
  ~ resource "aws_rds_cluster_parameter_group" "enable_audit_logging_v8" {
        id          = "wordpress-aurora-mysql8"
        name        = "wordpress-aurora-mysql8"
        tags        = {}
        # (5 unchanged attributes hidden)

      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "server_audit_events" -> null
          - value        = "CONNECT,QUERY_DCL,QUERY_DDL,QUERY_DML" -> null
        }
      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "server_audit_logging" -> null
          - value        = "1" -> null
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "server_audit_events"
          + value        = "CONNECT,QUERY_DCL,QUERY_DDL,QUERY_DML"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "server_audit_logging"
          + value        = "1"
        }

        # (1 unchanged block hidden)
    }

  # aws_secretsmanager_secret_version.database_host must be replaced
-/+ resource "aws_secretsmanager_secret_version" "database_host" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0|AB963223-C1BA-49E6-86CB-C8AFACF0F9E6" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "AB963223-C1BA-49E6-86CB-C8AFACF0F9E6" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_security_group_rule.client_vpn_ingress_database will be created
  + resource "aws_security_group_rule" "client_vpn_ingress_database" {
      + description              = "Client VPN ingress to the database"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0ffeb4f8a74eeab1f"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-098ae48afb5d878b3"
      + to_port                  = 3306
      + type                     = "ingress"
    }

Plan: 2 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ database_host_secret_arn         = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.enable_audit_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.enable_audit_logging_v8"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_host"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_name"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_password"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_username"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
